app/controllers/movies_controller.rb

UPDATE "movies" SET "description" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["description", "Filme foda"], ["updated_at", 2017-01-26 23:32:03 UTC], ["id", 2]]
---
  def update
    if @movie.update(movie_params)

INSERT INTO "movies" ("title", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "FatVini"], ["description", "Vini e Bruninha"], ["release_date", 2017-01-26 00:00:00 UTC], ["created_at", 2017-01-26 23:07:35 UTC], ["updated_at", 2017-01-26 23:07:35 UTC]]
---
  def create
    @movie = Movie.new(movie_params)
    if @movie.save

INSERT INTO "classifications" ("movie_id", "user_id", "score", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["movie_id", 1], ["user_id", 3], ["score", 5], ["created_at", 2017-01-30 23:22:50 UTC], ["updated_at", 2017-01-30 23:22:50 UTC]]
---
  def create_classification
    classification = Classification.new(classification_params)
    classification.user = current_user
    classification.movie = @movie
    if classification.save

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def set_movie
    id = params['id']
    @movie = Movie.find(id)